ajisuke3/app/views/recipes/index.html.erb

                <% end %>
                <%= recipe.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."recipe_id" = ?  [["recipe_id", 1]]