ajisuke3/app/controllers/favorites_controller.rb

    def destroy
        @food = Food.find(params[:food_id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]