ajisuke3/app/controllers/foods_controller.rb

  def index
    #@foods = Food.all
    @foods = Food.search(params[:search])
---
SELECT "foods".* FROM "foods" WHERE (food_name LIKE '%鶏%')