ajisuke3/app/controllers/recipes_controller.rb

  def index
    # Recipesの全てのレコードを参照
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id

    if @recipe.save
---
INSERT INTO "recipes" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テリヤキ"], ["body", "しょうゆ 大1\r\nみりん　 大1\r\n酒　　　 大1\r\nさとう　 小2"], ["user_id", 1], ["created_at", "2020-08-27 07:05:11.053781"], ["updated_at", "2020-08-27 07:05:11.053781"]]