ajisuke3/app/controllers/tastes_controller.rb

  def index
    # Tastesの全てのレコードを参照
    @tastes = Taste.all
---
SELECT "tastes".* FROM "tastes"

  def show
    @taste = Taste.find(params[:id])
---
SELECT "tastes".* FROM "tastes" WHERE "tastes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]