ajisuke4_foodのみ/app/controllers/favorites_controller.rb

    def create
        # current_user.favorites.create : current_userに結びついたいいねを取得
        # →　あとは、どのレシピにいいねをしたか記録
        @favorite = current_user.favorites.create(food_id: params[:food_id], taste_id: params[:taste_id])
---
INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "food_id", "taste_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["created_at", "2020-08-28 05:12:43.133910"], ["updated_at", "2020-08-28 05:12:43.133910"], ["food_id", 7], ["taste_id", 1]]

    def destroy
        @food = Food.find(params[:food_id])
        @taste = Taste.find(params[:taste_id])
        # 下のrecipe_idには上でfind下recipe_idがはいる
        @favorite = current_user.favorites.find_by(food_id: @food.id, taste_id: @taste.id)
        @favorite.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "tastes".* FROM "tastes" WHERE "tastes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."food_id" = ? LIMIT ?  [["user_id", 1], ["food_id", 7], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]