ajisuke4_foodのみ/app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE (food_name LIKE '%鶏%')
SELECT "tastes".* FROM "tastes"
---
  def index
    #@foods = Food.all
    @foods = Food.search(params[:search])
    @tastes = Taste.all