ajisuke4_foodのみ/app/controllers/tastes_controller.rb

SELECT "tastes".* FROM "tastes"
---
  def index
    # Tastesの全てのレコードを参照
    @tastes = Taste.all

SELECT "tastes".* FROM "tastes" WHERE "tastes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @taste = Taste.find(params[:id])