ajisuke3/app/models/user.rb

SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."food_id" = ? LIMIT ?  [["user_id", 1], ["food_id", 1], ["LIMIT", 1]]
---
  def already_favorited?(food)
    self.favorites.exists?(food_id: food.id)