ajisuke3/app/views/foods/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."food_id" = ?  [["food_id", 1]]
---
                <% end %>
                  <%= food.favorites.count %>