ajisuke4_foodのみ/app/views/foods/index.html.erb

            <% end %>
              <%= food.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."food_id" = ?  [["food_id", 1]]