ajisuke4_foodのみ/app/views/foods/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."food_id" = ?  [["food_id", 7]]
---
            <% end %>
              <%= @food.favorites.count %>